; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-3 - location
	p0-7 - location
	p1-4 - location
	p2-0 - location
	p3-1 - location
	p3-4 - location
	p4-5 - location
	p5-2 - location
	p5-3 - location
	p5-6 - location
	p6-0 - location
	p7-0 - location
	p7-3 - location
	p7-5 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s3)
	(at driver3 s5)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s1)
	(at package2 s7)
	(at package3 s2)
	(at package4 s1)
	(at package5 s6)
	(at package6 s0)
	(at package7 s7)
	(at package8 s0)
	(at package9 s2)
	(at package10 s7)
	(at package11 s4)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 8)
	(= (time-to-drive s3 s0) 8)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 97)
	(= (time-to-drive s4 s0) 97)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 33)
	(= (time-to-drive s7 s1) 33)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 48)
	(= (time-to-drive s1 s2) 48)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 58)
	(= (time-to-drive s6 s2) 58)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 27)
	(= (time-to-drive s7 s2) 27)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 76)
	(= (time-to-drive s1 s3) 76)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 24)
	(= (time-to-drive s2 s3) 24)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 84)
	(= (time-to-drive s5 s3) 84)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 39)
	(= (time-to-drive s6 s3) 39)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 68)
	(= (time-to-drive s2 s4) 68)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 89)
	(= (time-to-drive s6 s4) 89)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 17)
	(= (time-to-drive s2 s5) 17)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 78)
	(= (time-to-drive s6 s5) 78)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 16)
	(= (time-to-drive s0 s6) 16)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 71)
	(= (time-to-drive s4 s7) 71)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 97)
	(= (time-to-drive s5 s7) 97)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver3 s6)
	(at truck2 s4)
	(at truck3 s3)
	(at package1 s3)
	(at package2 s0)
	(at package3 s6)
	(at package4 s5)
	(at package5 s0)
	(at package6 s6)
	(at package7 s1)
	(at package8 s3)
	(at package9 s2)
	(at package10 s2)
	(at package11 s3)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver1 truck2 s6)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 15
2. (walk driver3 s5 p5-6)
   deleted: (at driver3 s5)
   added: (at driver3 p5-6)
   goals met: 1 of 15
3. (walk driver3 p5-6 s6)
   deleted: (at driver3 p5-6)
   added: (at driver3 s6)
   goals met: 2 of 15
4. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 160
   goals met: 2 of 15
5. (load-truck package6 truck2 s0)
   deleted: (at package6 s0)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 15
6. (load-truck package8 truck2 s0)
   deleted: (at package8 s0)
   added: (in package8 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 15
7. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 160 to 368
   goals met: 2 of 15
8. (unload-truck package6 truck2 s6)
   deleted: (in package6 truck2)
   added: (at package6 s6)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 3 of 15
9. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 15
10. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 368 to 576
   goals met: 3 of 15
11. (unload-truck package5 truck2 s0)
   deleted: (in package5 truck2)
   added: (at package5 s0)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 15
12. (drive-truck truck2 s0 s4 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 576 to 1643
   goals met: 5 of 15
13. (load-truck package11 truck2 s4)
   deleted: (at package11 s4)
   added: (in package11 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 5 of 15
14. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (fuel-used) from 1643 to 2527
   goals met: 4 of 15
15. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 15
16. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   goals met: 4 of 15
17. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   goals met: 4 of 15
18. (board-truck driver4 truck3 s0)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 15
19. (drive-truck truck3 s0 s3 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (fuel-used) from 2527 to 2607
   goals met: 5 of 15
20. (drive-truck truck2 s2 s1 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 2607 to 3375
   goals met: 5 of 15
21. (load-truck package1 truck2 s1)
   deleted: (at package1 s1)
   added: (in package1 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 5 of 15
22. (drive-truck truck2 s1 s7 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 3375 to 4035
   goals met: 5 of 15
23. (load-truck package2 truck2 s7)
   deleted: (at package2 s7)
   added: (in package2 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 5 of 15
24. (load-truck package7 truck2 s7)
   deleted: (at package7 s7)
   added: (in package7 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 5 of 15
25. (load-truck package10 truck2 s7)
   deleted: (at package10 s7)
   added: (in package10 truck2)
   changed: (load truck2) from 6 to 7, (fuel-per-minute truck2) from 31 to 38
   goals met: 5 of 15
26. (drive-truck truck2 s7 s2 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   changed: (fuel-used) from 4035 to 5061
   goals met: 5 of 15
27. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 5061 to 5973
   goals met: 5 of 15
28. (unload-truck package8 truck2 s3)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   changed: (load truck2) from 7 to 6, (fuel-per-minute truck2) from 38 to 31
   goals met: 6 of 15
29. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 7 of 15
30. (unload-truck package11 truck2 s3)
   deleted: (in package11 truck2)
   added: (at package11 s3)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 8 of 15
31. (drive-truck truck2 s3 s6 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (fuel-used) from 5973 to 6753
   goals met: 8 of 15
32. (unload-truck package3 truck2 s6)
   deleted: (in package3 truck2)
   added: (at package3 s6)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 15
33. (drive-truck truck2 s6 s3 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 6753 to 7377
   goals met: 9 of 15
34. (drive-truck truck3 s3 s5 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 7377 to 8217
   goals met: 8 of 15
35. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 8217 to 8601
   goals met: 8 of 15
36. (unload-truck package10 truck2 s2)
   deleted: (in package10 truck2)
   added: (at package10 s2)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 9 of 15
37. (drive-truck truck2 s2 s4 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 8601 to 9485
   goals met: 10 of 15
38. (drive-truck truck2 s4 s7 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   changed: (fuel-used) from 9485 to 10408
   goals met: 9 of 15
39. (drive-truck truck3 s5 s3 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 10408 to 11248
   goals met: 10 of 15
40. (drive-truck truck2 s7 s1 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 11248 to 11677
   goals met: 10 of 15
41. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 10 of 15
42. (unload-truck package7 truck2 s1)
   deleted: (in package7 truck2)
   added: (at package7 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 15
43. (drive-truck truck2 s1 s7 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 11677 to 12106
   goals met: 11 of 15
44. (drive-truck truck2 s7 s5 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 12106 to 13367
   goals met: 11 of 15
45. (unload-truck package4 truck2 s5)
   deleted: (in package4 truck2)
   added: (at package4 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 12 of 15
46. (drive-truck truck3 s3 s5 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (fuel-used) from 13367 to 14207
   goals met: 11 of 15
47. (drive-truck truck2 s5 s6 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s6)
   changed: (fuel-used) from 14207 to 15065
   goals met: 11 of 15
48. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 15065 to 15241
   goals met: 11 of 15
49. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 15
50. (drive-truck truck2 s0 s3 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 15241 to 15321
   goals met: 12 of 15
51. (drive-truck truck2 s3 s5 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   changed: (fuel-used) from 15321 to 16161
   goals met: 12 of 15
52. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 13 of 15
53. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 13 of 15
54. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 15
55. (drive-truck truck2 s5 s7 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   changed: (fuel-used) from 16161 to 17131
   goals met: 12 of 15
56. (drive-truck truck2 s7 s4 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (fuel-used) from 17131 to 17841
   goals met: 13 of 15
57. (disembark-truck driver1 truck2 s4)
   deleted: (driving driver1 truck2)
   added: (at driver1 s4) (empty truck2)
   goals met: 13 of 15
58. (walk driver1 s4 p4-5)
   deleted: (at driver1 s4)
   added: (at driver1 p4-5)
   goals met: 13 of 15
59. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 13 of 15
60. (walk driver1 p4-5 s5)
   deleted: (at driver1 p4-5)
   added: (at driver1 s5)
   goals met: 14 of 15
61. (drive-truck truck3 s5 s3 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 17841 to 18681
   goals met: 15 of 15
